<a href="https://colab.research.google.com/github/jkjh23/BusanAIDeveloperCourse_AI/blob/master/1_Analysis/5-3_pandas%20%EA%B3%A0%EA%B8%89%EA%B8%B0%EB%8A%A5_%ED%94%BC%EB%B2%97%ED%85%8C%EC%9D%B4%EB%B8%94.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_excel("/content/drive/My Drive/2020_AI_Busan/1_Analysis/data/sales.xlsx")
df.head(3)

   Account             Name           Rep  ... Quantity  Price     Status
0   714466  Trantow-Barrows  Craig Booker  ...        1  30000  presented
1   714466  Trantow-Barrows  Craig Booker  ...        1  10000  presented
2   714466  Trantow-Barrows  Craig Booker  ...        2   5000    pending

[3 rows x 8 columns]

In [6]:
df.shape

(17, 8)

In [7]:
df
# 데이터를 전체적으로 살펴보고, 특정 column들을 유추해보고(실제 설명자료를 받으면 명확하게 알 수 있음), ...
# 인사이트 분석
# 데이터를 보니, 특정 column에 중복으로 등장하는 데이터가 보임 → 피벗, 그룹화

    Account                          Name  ...   Price     Status
0    714466               Trantow-Barrows  ...   30000  presented
1    714466               Trantow-Barrows  ...   10000  presented
2    714466               Trantow-Barrows  ...    5000    pending
3    737550  Fritsch, Russel and Anderson  ...   35000   declined
4    146832                  Kiehn-Spinka  ...   65000        won
5    218895                     Kulas Inc  ...   40000    pending
6    218895                     Kulas Inc  ...   10000  presented
7    412290                 Jerde-Hilpert  ...    5000    pending
8    740150                    Barton LLC  ...   35000   declined
9    141962                    Herman LLC  ...   65000        won
10   163416                   Purdy-Kunde  ...   30000  presented
11   239344                    Stokes LLC  ...    5000    pending
12   239344                    Stokes LLC  ...   10000  presented
13   307599   Kassulke, Ondricka and Metz  ...    7000        won
14   688981                   Keeling LLC  ...  100000        won
15   729833                     Koepp Ltd  ...   65000   declined
16   729833                     Koepp Ltd  ...    5000  presented

[17 rows x 8 columns]

In [8]:
df.columns

Index(['Account', 'Name', 'Rep', 'Manager', 'Product', 'Quantity', 'Price',
       'Status'],
      dtype='object')

In [9]:
# 피벗 혹은 피벗테이블 → 변수 간 상하관계(종속적 관계) 등 보임, 수치적인 값 획득, ...
# 평균, 합산, ... → 데이터를 중심점 기준으로 재배치
pd.pivot_table( df, index = ['Name'] )
# index에 Name column의 값들만 배치됨
# Rep, Manager 제외
# Product, Status 제외 → 수치만 살아 남음, 기본값이 aggfunc='mean'이므로

                              Account   Price  Quantity
Name
Barton LLC                     740150   35000  1.000000
Fritsch, Russel and Anderson   737550   35000  1.000000
Herman LLC                     141962   65000  2.000000
Jerde-Hilpert                  412290    5000  2.000000
Kassulke, Ondricka and Metz    307599    7000  3.000000
Keeling LLC                    688981  100000  5.000000
Kiehn-Spinka                   146832   65000  2.000000
Koepp Ltd                      729833   35000  2.000000
Kulas Inc                      218895   25000  1.500000
Purdy-Kunde                    163416   30000  1.000000
Stokes LLC                     239344    7500  1.000000
Trantow-Barrows                714466   15000  1.333333

In [10]:
# name이 Trantow-Barrows인 데이터를 구하시오
# name이 Trantow-Barrows와 일치하는 조건을 만족하는 데이터를 구하시오
# df[ 조건식 ]
df[ df.Name == 'Trantow-Barrows' ]

   Account             Name           Rep  ... Quantity  Price     Status
0   714466  Trantow-Barrows  Craig Booker  ...        1  30000  presented
1   714466  Trantow-Barrows  Craig Booker  ...        1  10000  presented
2   714466  Trantow-Barrows  Craig Booker  ...        2   5000    pending

[3 rows x 8 columns]

In [11]:
# 인덱스에 Name, Rep, Manager를 표현하려고 함
# 인덱스에 3개 표현 = df에서 인덱스/컬럼 등은 n개의 레벨(depth)을 가질 수 있음
pd.pivot_table( df, index = ['Name', 'Rep', 'Manager'] )
# 나열한 index 간의 서열관계가 잘못되어서 표현이 개별적으로 나열됨 = 중복되는 데이터가 보임

                                                          Account  ...  Quantity
Name                         Rep           Manager                 ...
Barton LLC                   John Smith    Debra Henley    740150  ...  1.000000
Fritsch, Russel and Anderson Craig Booker  Debra Henley    737550  ...  1.000000
Herman LLC                   Cedric Moss   Fred Anderson   141962  ...  2.000000
Jerde-Hilpert                John Smith    Debra Henley    412290  ...  2.000000
Kassulke, Ondricka and Metz  Wendy Yule    Fred Anderson   307599  ...  3.000000
Keeling LLC                  Wendy Yule    Fred Anderson   688981  ...  5.000000
Kiehn-Spinka                 Daniel Hilton Debra Henley    146832  ...  2.000000
Koepp Ltd                    Wendy Yule    Fred Anderson   729833  ...  2.000000
Kulas Inc                    Daniel Hilton Debra Henley    218895  ...  1.500000
Purdy-Kunde                  Cedric Moss   Fred Anderson   163416  ...  1.000000
Stokes LLC                   Cedric Moss   Fred Anderson   239344  ...  1.000000
Trantow-Barrows              Craig Booker  Debra Henley    714466  ...  1.333333

[12 rows x 3 columns]

In [12]:
tmp = pd.pivot_table( df, index = ['Manager', 'Rep', 'Name'] )
tmp

                                                          Account  ...  Quantity
Manager       Rep           Name                                   ...
Debra Henley  Craig Booker  Fritsch, Russel and Anderson   737550  ...  1.000000
                            Trantow-Barrows                714466  ...  1.333333
              Daniel Hilton Kiehn-Spinka                   146832  ...  2.000000
                            Kulas Inc                      218895  ...  1.500000
              John Smith    Barton LLC                     740150  ...  1.000000
                            Jerde-Hilpert                  412290  ...  2.000000
Fred Anderson Cedric Moss   Herman LLC                     141962  ...  2.000000
                            Purdy-Kunde                    163416  ...  1.000000
                            Stokes LLC                     239344  ...  1.000000
              Wendy Yule    Kassulke, Ondricka and Metz    307599  ...  3.000000
                            Keeling LLC                    688981  ...  5.000000
                            Koepp Ltd                      729833  ...  2.000000

[12 rows x 3 columns]

In [13]:
# 17개의 데이터가 12개로 축소 = 1명이 여러 데이터를 가지고 있어서 통합됨
tmp.shape

(12, 3)

In [14]:
# 중간관리자 까지만 데이터 집계해서 인사고과 평가
tmp = pd.pivot_table( df, index = ['Manager', 'Rep'] )
tmp

                              Account         Price  Quantity
Manager       Rep
Debra Henley  Craig Booker   720237.0  20000.000000  1.250000
              Daniel Hilton  194874.0  38333.333333  1.666667
              John Smith     576220.0  20000.000000  1.500000
Fred Anderson Cedric Moss    196016.5  27500.000000  1.250000
              Wendy Yule     614061.5  44250.000000  3.000000

In [15]:
# 매니저까지만 데이터 집계해서 인사고과 평가
pd.pivot_table( df, index = ['Manager'] )

                     Account         Price  Quantity
Manager
Debra Henley   513112.222222  26111.111111  1.444444
Fred Anderson  405039.000000  35875.000000  2.125000

In [16]:
# df의 구성요소 중 index, values만 사용
pd.pivot_table( df, index = ['Manager', 'Rep'], values = ['Price'] )

                                    Price
Manager       Rep
Debra Henley  Craig Booker   20000.000000
              Daniel Hilton  38333.333333
              John Smith     20000.000000
Fred Anderson Cedric Moss    27500.000000
              Wendy Yule     44250.000000

In [17]:
# 기본 계산은 평균(mean)으로 수행, 이것을 합산으로 변경
pd.pivot_table( df, index = ['Manager', 'Rep'], values = ['Price'], aggfunc = np.sum )

                              Price
Manager       Rep
Debra Henley  Craig Booker    80000
              Daniel Hilton  115000
              John Smith      40000
Fred Anderson Cedric Moss    110000
              Wendy Yule     177000

In [18]:
# 평균과 합산을 같이 보고 싶음
tmp = pd.pivot_table( df, index = ['Manager', 'Rep'], values = ['Price'], aggfunc = [np.sum, np.mean, len] )
tmp

                                sum          mean   len
                              Price         Price Price
Manager       Rep
Debra Henley  Craig Booker    80000  20000.000000     4
              Daniel Hilton  115000  38333.333333     3
              John Smith      40000  20000.000000     2
Fred Anderson Cedric Moss    110000  27500.000000     4
              Wendy Yule     177000  44250.000000     4

In [19]:
tmp.index

MultiIndex([( 'Debra Henley',  'Craig Booker'),
            ( 'Debra Henley', 'Daniel Hilton'),
            ( 'Debra Henley',    'John Smith'),
            ('Fred Anderson',   'Cedric Moss'),
            ('Fred Anderson',    'Wendy Yule')],
           names=['Manager', 'Rep'])

In [20]:
tmp.columns

MultiIndex([( 'sum', 'Price'),
            ('mean', 'Price'),
            ( 'len', 'Price')],
           )

In [21]:
tmp.columns.levels

FrozenList([['sum', 'mean', 'len'], ['Price']])

In [22]:
tmp.columns.levels[0]

Index(['sum', 'mean', 'len'], dtype='object')

In [23]:
tmp.columns.levels[1]

Index(['Price'], dtype='object')

In [24]:
# tmp의 column의 level을 1개로 구성하고 각각 이름은 'sum', 'mean', len'으로 사용
# column 변경(column명에 공백/레벨 등이 존재, 의미가 불분명, df의 병합 수행할 때 key값이 상이, ...)
tmp.columns = tmp.columns.levels[0]
tmp

                                sum          mean  len
Manager       Rep
Debra Henley  Craig Booker    80000  20000.000000    4
              Daniel Hilton  115000  38333.333333    3
              John Smith      40000  20000.000000    2
Fred Anderson Cedric Moss    110000  27500.000000    4
              Wendy Yule     177000  44250.000000    4

In [25]:
# column명 1개만 변경하고자 하니 생기는 문제점
# Index does not support mutable operations → (현재시점) column명을 변경하려면 전체 다 변경해라
try:
  tmp.columns[-1] = 'counts'
  tmp
except Exception as e :
  print("Error")

Error

In [26]:
pd.pivot_table( 
    df, 
    index   = ['Manager', 'Rep'], 
    values  = ['Price'], 
    columns = ['Product'],
    aggfunc = [np.sum] 
)
# 제품이 추가되니, 어느 부서가 무엇을 잘 팔고 무엇을 못 파는지 집계 → 향후 약점을 보완할 것인지 강점을 강화할 건인지 전략 수립 可

                                  sum
                                Price
Product                           CPU Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker    65000.0      5000.0     NaN  10000.0
              Daniel Hilton  105000.0         NaN     NaN  10000.0
              John Smith      35000.0      5000.0     NaN      NaN
Fred Anderson Cedric Moss     95000.0      5000.0     NaN  10000.0
              Wendy Yule     165000.0      7000.0  5000.0      NaN

In [27]:
# 결측치 0으로 처리
tmp = pd.pivot_table( 
    df, 
    index   = ['Manager', 'Rep'], 
    values  = ['Price'], 
    columns = ['Product'],
    aggfunc = [np.sum] 
)
tmp.fillna(0)

                                  sum
                                Price
Product                           CPU Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker    65000.0      5000.0     0.0  10000.0
              Daniel Hilton  105000.0         0.0     0.0  10000.0
              John Smith      35000.0      5000.0     0.0      0.0
Fred Anderson Cedric Moss     95000.0      5000.0     0.0  10000.0
              Wendy Yule     165000.0      7000.0  5000.0      0.0

In [28]:
# 처음부터 피벗의 결과값을 정수로 표현하고 싶음
# fill_value = 0 : 기본값을 0으로 다 채우고 나서 피벗하시오
tmp = pd.pivot_table( 
    df, 
    index      = ['Manager', 'Rep'], 
    values     = ['Price'], 
    columns    = ['Product'],
    aggfunc    = [np.sum],
    fill_value = 0 
)
tmp

                                sum
                              Price
Product                         CPU Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker    65000        5000       0    10000
              Daniel Hilton  105000           0       0    10000
              John Smith      35000        5000       0        0
Fred Anderson Cedric Moss     95000        5000       0    10000
              Wendy Yule     165000        7000    5000        0

In [29]:
tmp = pd.pivot_table( 
    df, 
    index      = ['Manager', 'Rep'], 
    values     = ['Price'], 
    columns    = ['Product'],
    aggfunc    = [np.sum],
    fill_value = 0.0
)
tmp
# fill_value = 0.0 으로 쓰면 거의 무시됨

                                sum
                              Price
Product                         CPU Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker    65000        5000       0    10000
              Daniel Hilton  105000           0       0    10000
              John Smith      35000        5000       0        0
Fred Anderson Cedric Moss     95000        5000       0    10000
              Wendy Yule     165000        7000    5000        0